       IDENTIFICATION DIVISION.
       PROGRAM-ID. TEST1.
       
       ENVIRONMENT DIVISION. 

       DATA DIVISION.

       PROCEDURE DIVISION.
             DISPLAY "HELLO,WORLD!".
             STOP RUN.
             